In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv("transactions.csv")
df[(df["t_date"]=="11-15-2015")]

,t_date,cust_id,t_amt,services,products_used,city,state,t_details
200,11-15-2015,4008344,41.92,Water Sports,Scuba Diving & Snorkeling,Colorado Springs,Colorado,credit
1801,11-15-2015,4001191,158.90,Outdoor Recreation,Golf,Colorado Springs,Colorado,credit
2083,11-15-2015,4000041,108.56,Jumping,Trampoline Accessories,Jacksonville,Florida,credit
2291,11-15-2015,4006266,96.44,Exercise & Fitness,Weightlifting Machine Accessories,Huntsville,Alabama,credit
2714,11-15-2015,4008446,22.66,Outdoor Play Equipment,Lawn Water Slides,Oakland,California,credit
...,...,...,...,...,...,...,...,...
46763,11-15-2015,4001972,156.92,Water Sports,Bodyboarding,Boise,Idaho,credit
48612,11-15-2015,4004926,32.07,Water Sports,Kitesurfing,Reno,Nevada,credit
48924,11-15-2015,4006762,145.21,Games,Mahjong,Kansas City,Missouri,credit
49301,11-15-2015,4006429,182.67,Indoor Games,Foosball,Columbus,Georgia,credit
49804,11-15-2015,4004346,13.74,Outdoor Recreation,Camping & Backpacking & Hiking,Chattanooga,Tennessee,credit

### What is the total sales amount across all transactions?

In [2]:
df["t_details"].value_counts(dropna=False)

t_details
credit    43151
cash       6849
Name: count, dtype: int64

In [3]:
df["t_amt"].value_counts(dropna=False)

t_amt
109.17    11
154.13    11
46.82     10
152.18    10
198.91    10
          ..
106.38     1
121.39     1
180.28     1
193.63     1
98.81      1
Name: count, Length: 17920, dtype: int64

In [4]:
df["t_amt"].sum()

np.float64(5110820.54)

### Which month had the highest total transaction amount?

In [5]:
x=df["t_date"][df["t_amt"].max()]
month=int(x[0:2])
month

11

### What is the average transaction amount per customer?

In [6]:
df.groupby("cust_id")["t_amt"].mean()

cust_id
4000000    127.444000
4000001    108.945556
4000002     56.165000
4000003    123.670000
4000004    168.135000
              ...
4009995     65.018571
4009996    104.515000
4009997    121.547500
4009998    110.950000
4009999     85.252500
Name: t_amt, Length: 9926, dtype: float64

### What is the trend of total sales over months?

In [7]:
df["month"]=df["t_date"].str[0:2]
df.groupby("month")["t_amt"].sum()

month
01    438165.76
02    395262.37
03    444664.24
04    420695.24
05    432627.58
06    421074.55
07    439560.80
08    434255.01
09    429321.63
10    424856.28
11    408846.35
12    421490.73
Name: t_amt, dtype: float64

### What is the highest single transaction amount recorded?

In [8]:
df["t_amt"].max()

np.float64(200.0)

### Which service category contributes the most to total revenue?

In [9]:
df.groupby("services")["t_amt"].sum().tail(1)

services
Winter Sports    321973.56
Name: t_amt, dtype: float64

### Which product generated the highest revenue?

In [10]:
df.groupby("products_used")["t_amt"].sum().tail(1)

products_used
Yoga & Pilates    47804.94
Name: t_amt, dtype: float64

### How does the average transaction amount vary between services?

In [11]:
df.groupby("services")["t_amt"].mean()

services
Air Sports                103.455104
Combat Sports             101.061761
Dancing                   102.907512
Exercise & Fitness        103.660247
Games                     102.272968
Gymnastics                102.385901
Indoor Games              103.074684
Jumping                   102.155171
Outdoor Play Equipment    101.281196
Outdoor Recreation        100.999480
Puzzles                   100.595997
Racquet Sports            103.647461
Team Sports               102.738998
Water Sports              101.899975
Winter Sports             101.217718
Name: t_amt, dtype: float64

### How many unique customers made purchases?

In [12]:
df["cust_id"].nunique()

9926

### Which customers have spent the most overall?

In [13]:
df.groupby("cust_id")["t_amt"].sum().tail(1)

cust_id
4009999    682.02
Name: t_amt, dtype: float64

### What is the average number of transactions per customer?

In [14]:
df.groupby("cust_id")["t_amt"].count()
#df[df["cust_id"]==4000002]

cust_id
4000000    5
4000001    9
4000002    2
4000003    3
4000004    4
          ..
4009995    7
4009996    8
4009997    4
4009998    6
4009999    8
Name: t_amt, Length: 9926, dtype: int64

### Are there customers who made multiple purchases in different categories?

In [15]:
x=df.groupby("cust_id").filter(lambda x:x["services"].nunique()==2)
x

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
30,03-14-2015,4009693,47.05,Water Sports,Swimming,Lincoln,Nebraska,credit,03
56,06-21-2015,4008744,176.63,Outdoor Recreation,Geocaching,Boston,Massachusetts,credit,06
59,11-07-2015,4002854,21.43,Winter Sports,Snowboarding,Philadelphia,Pennsylvania,cash,11
66,02-05-2015,4006293,89.14,Outdoor Recreation,Tetherball,Gresham,Oregon,credit,02
71,01-26-2015,4009360,152.21,Team Sports,Cricket,Portland,Oregon,credit,01
...,...,...,...,...,...,...,...,...,...
49848,07-22-2015,4006571,166.54,Team Sports,Curling,Lexington,Kentucky,credit,07
49880,06-29-2015,4001913,75.02,Indoor Games,Billiards,Charlotte,North Carolina,credit,06
49888,04-19-2015,4008433,124.88,Gymnastics,Vaulting Horses,Jersey City,New Jersey,credit,04
49912,11-05-2015,4002703,159.28,Air Sports,Parachutes,Orlando,Florida,credit,11
49990,08-10-2015,4002940,144.91,Exercise & Fitness,Medicine Balls,Minneapolis,Minnesota,credit,08

### what percentage of customers are repeat buyers

### Which product category has the highest total sales?

In [16]:
df.groupby("products_used")["t_amt"].sum().tail(1)

products_used
Yoga & Pilates    47804.94
Name: t_amt, dtype: float64

### Which services are most popular by transaction count?

In [17]:
df.groupby("services")["t_amt"].sum().tail(1)

services
Winter Sports    321973.56
Name: t_amt, dtype: float64

### For each service, which product type is purchased most frequently?

In [18]:
df.groupby("services")["products_used"].count().sort_values(ascending=False).head(1)

services
Outdoor Recreation    8383
Name: products_used, dtype: int64

### What is the average transaction amount per product type?

In [19]:
df.groupby("products_used")["t_amt"].mean()

products_used
Abdominal Equipment    105.362798
Air Hockey             103.775478
Air Suits              101.421832
Archery                 97.345564
Badminton              108.441138
                          ...
Wetsuits               102.042775
Whitewater Rafting     102.877744
Windsurfing            104.161453
Wrestling               97.895364
Yoga & Pilates         107.668784
Name: t_amt, Length: 125, dtype: float64

### Are there specific services where customers spend significantly more?

In [20]:
x=df.groupby("services")["t_amt"].sum().sum()
x=x/50000
x
y=df.groupby("services").filter(lambda i:i["t_amt"].sum()>x)
y.groupby("services")["t_amt"].sum().sort_values(ascending=False).head(1)

services
Outdoor Recreation    846678.64
Name: t_amt, dtype: float64

### Which state has the highest total sales?

In [21]:
df.groupby("state")["t_amt"].sum().sort_values(ascending=False).head(1)

state
California    702346.23
Name: t_amt, dtype: float64

### Which city records the highest number of transactions?

In [22]:
df.groupby("city")["t_amt"].sum().sort_values(ascending=False).head(1)

city
Pasadena    95533.98
Name: t_amt, dtype: float64

### What is the average spending per transaction in each state?

In [23]:
df.groupby("state")["t_amt"].mean()

state
Alabama                 102.487049
Arizona                 102.172241
California              102.652182
Colorado                101.537415
Connecticut              99.982108
District of Columbia    103.800334
Florida                 103.136567
Georgia                 102.330675
Hawaii                  101.536667
Idaho                    98.969538
Illinois                100.166315
Indiana                 100.712664
Iowa                    103.100727
Kansas                  101.436926
Kentucky                104.130392
Louisiana               103.466335
Maryland                100.506913
Massachusetts           104.541571
Michigan                101.547777
Minnesota               103.465157
Mississippi             101.214926
Missouri                100.969040
Nebraska                101.955690
Nevada                  105.434718
New Jersey              103.438005
New York                100.259452
North Carolina          103.033172
Ohio                    101.350817
Oklahoma                104.995771
Oregon                  102.438143
Pennsylvania            102.776034
South Carolina          103.540065
Tennessee                99.265804
Texas                   101.379891
Utah                    104.507560
Virginia                104.976206
Washington              101.401603
Wisconsin               101.953159
Name: t_amt, dtype: float64

### Are certain services more popular in specific states?

In [24]:
df.value_counts(["state", "services"])

state           services
California      Outdoor Recreation    1188
                Exercise & Fitness     988
Texas           Outdoor Recreation     830
                Exercise & Fitness     818
California      Team Sports            816
                                      ...
Maryland        Dancing                  3
North Carolina  Dancing                  2
Mississippi     Puzzles                  2
Hawaii          Dancing                  2
                Air Sports               2
Name: count, Length: 570, dtype: int64

### Which states buy the most Outdoor Recreation products?

In [25]:
x=df[df["services"]=="Outdoor Recreation"]
x["state"].value_counts()

state
California              1188
Texas                    830
Florida                  483
Oregon                   335
Tennessee                313
Ohio                     307
Colorado                 279
Washington               276
Massachusetts            253
Arizona                  247
Missouri                 226
New Jersey               225
Illinois                 224
Alabama                  191
Virginia                 186
Wisconsin                180
Minnesota                169
South Carolina           162
Kentucky                 156
Kansas                   154
Pennsylvania             154
Georgia                  153
North Carolina           153
Michigan                 152
Nebraska                 149
Connecticut              140
New York                 140
Utah                     136
Nevada                   135
Indiana                   91
Idaho                     81
Maryland                  80
Mississippi               78
Louisiana                 77
Iowa                      74
Hawaii                    72
Oklahoma                  70
District of Columbia      64
Name: count, dtype: int64

### Compare average spending between California and Texas customers.

In [26]:
x=df[df["state"]=="California"]
y=df[df["state"]=="Texas"]
print("California:",x["t_amt"].sum())
print("Texas:",y["t_amt"].sum())

California: 702346.23
Texas: 541267.24

### Which quarter of the year saw the highest sales?

In [27]:
x=df["t_date"][df["t_amt"].max()]
x=int(x[0:2])
if 1<=x<=4:
    print("First Quarter")
elif 4<x<=8:
    print("Second Quarter")
else:
    print("Third Quarter")

Third Quarter

### How does total sales vary month by month?

In [28]:
df.groupby("month")["t_amt"].sum()

month
01    438165.76
02    395262.37
03    444664.24
04    420695.24
05    432627.58
06    421074.55
07    439560.80
08    434255.01
09    429321.63
10    424856.28
11    408846.35
12    421490.73
Name: t_amt, dtype: float64

### What is the total number of transactions per month?

In [29]:
df.groupby("month")["t_amt"].sum()

month
01    438165.76
02    395262.37
03    444664.24
04    420695.24
05    432627.58
06    421074.55
07    439560.80
08    434255.01
09    429321.63
10    424856.28
11    408846.35
12    421490.73
Name: t_amt, dtype: float64

### Is there a particular season when sports equipment sales spike?

In [30]:
df["services"].value_counts()

services
Outdoor Recreation        8383
Exercise & Fitness        7394
Team Sports               6010
Water Sports              5219
Games                     3666
Gymnastics                3196
Winter Sports             3181
Outdoor Play Equipment    2910
Indoor Games              2799
Jumping                   2015
Combat Sports             1630
Racquet Sports            1611
Air Sports                 960
Puzzles                    612
Dancing                    414
Name: count, dtype: int64

### How many transactions were done using credit?

In [31]:
df.groupby("t_details")["t_amt"].count().tail(1)

t_details
credit    43151
Name: t_amt, dtype: int64

### What is the total revenue generated from credit transactions?

In [32]:
df.groupby("t_details")["t_amt"].sum().tail(1)

t_details
credit    4923134.93
Name: t_amt, dtype: float64

### Is there a difference in average spending between credit and cash customers?

In [34]:
x=df.groupby("t_details")["t_amt"].sum().tail(1).max()
y=df.groupby("t_details")["t_amt"].sum().head(1).max()
print("Credit-Cash:",y-x)

Credit-Cash: -4735449.319999999

### Which states or cities should the company focus on for marketing high-value products?

In [50]:
x=df.groupby(["products_used","state"])["t_amt"].sum().sort_values(ascending=False).head(9)
x

products_used           state
Swing Sets              California    8570.77
Yoga & Pilates          California    8090.65
Weightlifting Machines  California    7642.54
Basketball              California    7428.87
Swimming                California    7369.48
Golf                    California    7297.54
Mahjong                 California    7219.48
Board Games             California    7186.08
Cheerleading            California    7091.34
Name: t_amt, dtype: float64

### Should more inventory be stocked for Exercise & Fitness products given their popularity?

### Are there product categories with high sales but low average transaction amounts?

In [51]:
df.groupby("products_used")["t_amt"].agg(["sum", "mean"])

                          sum        mean
products_used
Abdominal Equipment  43304.11  105.362798
Air Hockey           40161.11  103.775478
Air Suits            19371.57  101.421832
Archery              37088.66   97.345564
Badminton            44786.19  108.441138
...                       ...         ...
Wetsuits             38980.34  102.042775
Whitewater Rafting   41048.22  102.877744
Windsurfing          43018.68  104.161453
Wrestling            40332.89   97.895364
Yoga & Pilates       47804.94  107.668784

[125 rows x 2 columns]

### Are there underperforming service categories that need promotional offers?

In [57]:
x=df.groupby("services")["t_amt"].transform("mean")
df[df["t_amt"]<x]

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month
0,06-26-2015,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit,06
2,06-01-2015,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit,06
4,12-17-2015,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit,12
6,10-28-2015,4002190,27.89,Puzzles,Jigsaw Puzzles,Charleston,South Carolina,credit,10
7,07-14-2015,4002964,96.01,Outdoor Play Equipment,Sandboxes,Columbus,Ohio,credit,07
...,...,...,...,...,...,...,...,...,...
49987,09-07-2015,4003274,7.65,Games,Bingo Sets,Durham,North Carolina,cash,09
49988,08-13-2015,4007405,65.54,Winter Sports,Cross-Country Skiing,Oklahoma City,Oklahoma,credit,08
49993,06-02-2015,4007367,50.32,Team Sports,Field Hockey,Stamford,Connecticut,credit,06
49995,09-18-2015,4005664,53.95,Games,Dice Games,Irving,Texas,credit,09
49997,05-03-2015,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash,05